<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0b262c9311c3504251c420dabbc755e3b8a7fcec4fe70b71a6602bf15ce84c3f","plan_job_ref":"Job Terraform Plan #400 at https://github.com/cal-itp/data-infra/actions/runs/16258051600","plan_out_hash":"22e9c5ac93703de9f412d3fce54044e58342fa971d5f31e11418683710af0aaa","plan_hash":"2d536b19b942eed60b67400deae909120d31361e11424a49b87f41a9db5fb97b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gcs/us__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket.calitp["calitp-kuba"] will be created
+   resource "google_storage_bucket" "calitp" {
+       default_event_based_hold    = false
+       effective_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       force_destroy               = false
+       id                          = (known after apply)
+       location                    = "US-WEST2"
+       name                        = "calitp-kuba"
+       project                     = "cal-itp-data-infra"
+       project_number              = (known after apply)
+       public_access_prevention    = "inherited"
+       requester_pays              = false
+       rpo                         = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       terraform_labels            = {
+           "goog-terraform-provisioned" = "true"
        }
+       time_created                = (known after apply)
+       uniform_bucket_level_access = true
+       updated                     = (known after apply)
+       url                         = (known after apply)

+       soft_delete_policy (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # google_storage_bucket.tfer--rt-parsed-deprecated will be updated in-place
!~  resource "google_storage_bucket" "tfer--rt-parsed-deprecated" {
        id                          = "rt-parsed-deprecated"
        name                        = "rt-parsed-deprecated"
!~      terraform_labels            = {
+           "deprecated" = (known after apply)
        }
#        (16 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+   google_storage_bucket_calitp-kuba_name                                                                     = "calitp-kuba"
!~  google_storage_bucket_iam_binding_tfer--test-calitp-reports-data_id                                        = "****************************************************************************************"
```
</details>

:memo: Plan generated in [Terraform Plan #400](https://github.com/cal-itp/data-infra/actions/runs/16258051600)